app/controllers/songs_controller.rb

  def new
    if params[:artist_id] && !Artist.exists?(id: params[:artist_id])
---
SELECT "artists".* FROM "artists"